## description

## 目的
操控小车寻找识别二维码

## 需求设计
寻找二维码 → 发现二维码 → 调整视角/距离 → 稳定识别 → 计算二维码相对位姿

## 方案选择
方案一：Linux 主机 + ROS 2 + OpenCV —— 偏机器人/算法，开发快，功能完整。
方案二：STM32 裸机/RTOS + 摄像头 + 视觉算法 —— 偏嵌入式，资源受限，但能深入底层。
方案三：嵌入式视觉 + STM32”就是把“看东西”和“控制小车”拆给两个不同的芯片



## 思路
### 方案一：ROS 负责机器人系统，OpenCV 负责视觉，STM32 负责底盘实时控制。
                  ┌──────────────────────┐
                  │      Ubuntu PC       │
                  │                      │
                  │       ROS 2          │
                  └──────────┬───────────┘
                             │
          ┌──────────────────┼──────────────────┐
          │                  │                  │
          ▼                  ▼                  ▼
     Camera Node        QR Detector       Robot Control
          │                  │                  │
          │                  ▼                  │
          │             QR ID + corners       │
          │                  │                  │
          │                  ▼                  │
          │              solvePnP              │
          │                  │                  │
          │                  ▼                  │
          │              QR Pose               │
          │                  │                  │
          └──────────────────┼──────────────────┘
                             │
                             ▼
                         /cmd_vel
                             │
                             ▼
                       STM32 / 电机驱动
                             │
                             ▼
                           小车

### 方案二：STM32 直接做
                  STM32
                        │
            ┌───────────┼────────────┐
            │           │            │
            ▼           ▼            ▼
      Camera       IMU         Encoder
            │
            ▼
      图像处理
            │
            ▼
      QR Detection
            │
            ▼
      QR Pose
            │
            ▼
      Motor Control


### 方案三

                 ┌──────────────┐
                 │    Camera    │
                 └──────┬───────┘
                        │
                        ▼
                 ┌──────────────┐
                 │    OpenMV    │
                 │              │
                 │ 图像处理     │
                 │ QR检测       │
                 │ QR解码       │
                 │ 位姿估计     │
                 └──────┬───────┘
                        │
                 UART / CAN
                        │
                        ▼
                 ┌──────────────┐
                 │    STM32     │
                 │              │
                 │ 状态机       │
                 │ PID          │
                 │ 编码器       │
                 │ IMU          │
                 │ PWM          │
                 └──────┬───────┘
                        │
                        ▼
                    电机驱动
                        │
                        ▼
                       小车


## 具体设计
